(TeX-add-style-hook
 "chapter3"
 (lambda ()
   (LaTeX-add-labels
    "fig:32"
    "fig:33"
    "fig:34"
    "tab:2"
    "fig:35"
    "fig:36"
    "fig:37"
    "fig:38"
    "fig:39"
    "fig:40"
    "fig:41"
    "fig:42"
    "fig:43"
    "fig:44"
    "fig:45"
    "fig:46")
   (LaTeX-add-index-entries
    "яхта!крейсерская"
    "яхта!туристская"
    "яхта!парусно-моторная"
    "яхта!моторно-парусная"
    "яхта!для внутренних вод"
    "яхта!для озёрного плавания"
    "яхта!для прибрежного морского плавания"
    "яхта!океанская"
    "устройство!якорное"
    "якорное устройство"
    "якорь!становой"
    "якорь!завозной"
    "верп"
    "дрек"))
 :latex)

